cesanta/mongoose/examples/nxp/frdm-mcxn947-xpresso-baremetal-builtin/drivers/fsl_clock.h
    kCLOCK_Espi      = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 0),    /*!< Clock gate name: Espi. */
    kCLOCK_Dma1      = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 1),    /*!< Clock gate name: Dma1. */
    kCLOCK_Enet      = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 2),    /*!< Clock gate name: Enet. */
    kCLOCK_uSdhc     = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 3),    /*!< Clock gate name: uSdhc. */
    kCLOCK_Flexio    = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 4),    /*!< Clock gate name: Flexio. */
    kCLOCK_Sai0      = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 5),    /*!< Clock gate name: Sai0. */
    kCLOCK_Sai1      = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 6),    /*!< Clock gate name: Sai1. */
    kCLOCK_Tro       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 7),    /*!< Clock gate name: Tro. */
    kCLOCK_Freqme    = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 8),    /*!< Clock gate name: Freqme. */
    kCLOCK_Trng      = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 13),   /*!< Clock gate name: Trng. */
    kCLOCK_Flexcan0  = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 14),   /*!< Clock gate name: Flexcan0. */
    kCLOCK_Flexcan1  = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 15),   /*!< Clock gate name: Flexcan1. */
    kCLOCK_UsbHs     = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 16),   /*!< Clock gate name: UsbHs. */
    kCLOCK_UsbHsPhy  = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 17),   /*!< Clock gate name: UsbHsPhy. */
    kCLOCK_Css       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 18),   /*!< Clock gate name: Css. */
    kCLOCK_PowerQuad = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 19),   /*!< Clock gate name: PowerQuad. */
    kCLOCK_PluLut    = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 20),   /*!< Clock gate name: PluLut. */
    kCLOCK_Timer3    = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 21),   /*!< Clock gate name: Timer3. */
    kCLOCK_Timer4    = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 22),   /*!< Clock gate name: Timer4. */
    kCLOCK_Puf       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 23),   /*!< Clock gate name: Puf. */
    kCLOCK_Pkc       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 24),   /*!< Clock gate name: Pkc. */
    kCLOCK_Scg       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 26),   /*!< Clock gate name: Scg. */
    kCLOCK_Gdet      = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 29),   /*!< Clock gate name: Gdet. */
    kCLOCK_Sm3       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 30),   /*!< Clock gate name: Sm3. */

    kCLOCK_I3c0        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 0),  /*!< Clock gate name: I3c0. */
    kCLOCK_I3c1        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 1),  /*!< Clock gate name: I3c1. */
    kCLOCK_Sinc        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 2),  /*!< Clock gate name: Sinc. */
    kCLOCK_CoolFlux    = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 3),  /*!< Clock gate name: CoolFlux. */
    kCLOCK_Enc0        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 4),  /*!< Clock gate name: Enc0. */
    kCLOCK_Enc1        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 5),  /*!< Clock gate name: Enc1. */
    kCLOCK_Pwm0        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 6),  /*!< Clock gate name: Pwm0. */
    kCLOCK_Pwm1        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 7),  /*!< Clock gate name: Pwm1. */
    kCLOCK_Evtg        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 8),  /*!< Clock gate name: Evtg. */
    kCLOCK_Dac1        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 11), /*!< Clock gate name: Dac1. */
    kCLOCK_Dac2        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 12), /*!< Clock gate name: Dac2. */
    kCLOCK_Opamp0      = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 13), /*!< Clock gate name: Opamp0. */
    kCLOCK_Opamp1      = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 14), /*!< Clock gate name: Opamp1. */
    kCLOCK_Opamp2      = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 15), /*!< Clock gate name: Opamp2. */
    kCLOCK_Cmp2        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 18), /*!< Clock gate name: Cmp2. */
    kCLOCK_Vref        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 19), /*!< Clock gate name: Vref. */
    kCLOCK_CoolFluxApb = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 20), /*!< Clock gate name: CoolFluxApb. */
    kCLOCK_Neutron     = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 21), /*!< Clock gate name: Neutron. */
    kCLOCK_Tsi         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 22), /*!< Clock gate name: Tsi. */
    kCLOCK_Ewm         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 23), /*!< Clock gate name: Ewm. */
    kCLOCK_Ewm0        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 23), /*!< Clock gate name: Ewm. */
    kCLOCK_Eim         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 24), /*!< Clock gate name: Eim. */
    kCLOCK_Erm         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 25), /*!< Clock gate name: Erm. */
    kCLOCK_Intm        = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 26), /*!< Clock gate name: Intm. */
    kCLOCK_Sema42      = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 27), /*!< Clock gate name: Sema42. */

    kCLOCK_Pwm0_Sm0 = CLK_GATE_DEFINE(REG_PWM0SUBCTL, 0U),   /*!< Clock gate name: PWM0 SM0. */
    kCLOCK_Pwm0_Sm1 = CLK_GATE_DEFINE(REG_PWM0SUBCTL, 1U),   /*!< Clock gate name: PWM0 SM1. */
    kCLOCK_Pwm0_Sm2 = CLK_GATE_DEFINE(REG_PWM0SUBCTL, 2U),   /*!< Clock gate name: PWM0 SM2. */
    kCLOCK_Pwm0_Sm3 = CLK_GATE_DEFINE(REG_PWM0SUBCTL, 3U),   /*!< Clock gate name: PWM0 SM3. */

    kCLOCK_Pwm1_Sm0 = CLK_GATE_DEFINE(REG_PWM1SUBCTL, 0U),   /*!< Clock gate name: PWM1 SM0. */
    kCLOCK_Pwm1_Sm1 = CLK_GATE_DEFINE(REG_PWM1SUBCTL, 1U),   /*!< Clock gate name: PWM1 SM1. */
    kCLOCK_Pwm1_Sm2 = CLK_GATE_DEFINE(REG_PWM1SUBCTL, 2U),   /*!< Clock gate name: PWM1 SM2. */
    kCLOCK_Pwm1_Sm3 = CLK_GATE_DEFINE(REG_PWM1SUBCTL, 3U)    /*!< Clock gate name: PWM1 SM3. */

} clock_ip_name_t;

/*! @brief Peripherals clock source definition. */
#define BUS_CLK kCLOCK_BusClk

#define I2C0_CLK_SRC BUS_CLK

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{
    kCLOCK_MainClk,     /*!< Main clock                                              */
    kCLOCK_CoreSysClk,  /*!< Core/system clock                                       */
    kCLOCK_BusClk,      /*!< Bus clock (AHB clock)                                   */
    kCLOCK_SystickClk0, /*!< Systick clock0                                          */
    kCLOCK_SystickClk1, /*!< Systick clock1                                          */
    kCLOCK_ClockOut,    /*!< CLOCKOUT                                                */
    kCLOCK_Fro12M,      /*!< FRO12M                                                  */
    kCLOCK_Clk1M,       /*!< CLK1M                                                   */
    kCLOCK_FroHf,       /*!< FRO48/144                                               */
    kCLOCK_Clk48M,      /*!< CLK48M                                                  */
    kCLOCK_Clk144M,     /*!< CLK144M                                                 */
    kCLOCK_Clk16K0,     /*!< CLK16K[0]                                               */
    kCLOCK_Clk16K1,     /*!< CLK16K[1]                                               */
    kCLOCK_Clk16K2,     /*!< CLK16K[2]                                               */
    kCLOCK_Clk16K3,     /*!< CLK16K[3]                                               */
    kCLOCK_ExtClk,      /*!< External Clock                                          */
    kCLOCK_Osc32K0,     /*!< OSC32K[0]                                               */
    kCLOCK_Osc32K1,     /*!< OSC32K[1]                                               */
    kCLOCK_Osc32K2,     /*!< OSC32K[2]                                               */
    kCLOCK_Osc32K3,     /*!< OSC32K[3]                                               */
    kCLOCK_Pll0Out,     /*!< PLL0 Output                                             */
    kCLOCK_Pll1Out,     /*!< PLL1 Output                                             */
    kCLOCK_UsbPllOut,   /*!< USB PLL Output                                          */
    kCLOCK_LpOsc,       /*!< lp_osc                                                  */
} clock_name_t;

/*! @brief Clock Mux Switches
 *  The encoding is as follows each connection identified is 32bits wide while 24bits are valuable
 *  starting from LSB upwards
 *
 *  [4 bits for choice, 0 means invalid choice] [8 bits mux ID]*
 *
 */

#define CLK_ATTACH_ID(mux, sel, pos) \
    ((((uint32_t)(mux) << 0U) | (((uint32_t)(sel) + 1U) & 0xFU) << 12U) << ((uint32_t)(pos)*16U))
#define MUX_A(mux, sel)           CLK_ATTACH_ID((mux), (sel), 0U)
#define MUX_B(mux, sel, selector) (CLK_ATTACH_ID((mux), (sel), 1U) | ((selector) << 24U))

#define GET_ID_ITEM(connection)      ((connection)&0xFFFFU)
#define GET_ID_NEXT_ITEM(connection) ((connection) >> 16U)
#define GET_ID_ITEM_MUX(connection)  (((uint16_t)connection) & 0xFFFU)
#define GET_ID_ITEM_SEL(connection)  ((uint8_t)((((uint32_t)(connection)&0xF000U) >> 12U) - 1U))
#define GET_ID_SELECTOR(connection)  ((connection)&0xF000000U)

#define CM_SYSTICKCLKSEL0   0U
#define CM_SYSTICKCLKSEL1   ((0x264 - 0x260) / 4)
#define CM_TRACECLKSEL      ((0x268 - 0x260) / 4)
#define CM_CTIMERCLKSEL0    ((0x26C - 0x260) / 4)
#define CM_CTIMERCLKSEL1    ((0x270 - 0x260) / 4)
#define CM_CTIMERCLKSEL2    ((0x274 - 0x260) / 4)
#define CM_CTIMERCLKSEL3    ((0x278 - 0x260) / 4)
#define CM_CTIMERCLKSEL4    ((0x27C - 0x260) / 4)
#define CM_CLKOUTCLKSEL     ((0x288 - 0x260) / 4)
#define CM_ADC0CLKSEL       ((0x2A4 - 0x260) / 4)
#define CM_USB0CLKSEL       ((0x2A8 - 0x260) / 4)
#define CM_FCCLKSEL0        ((0x2B0 - 0x260) / 4)
#define CM_FCCLKSEL1        ((0x2B4 - 0x260) / 4)
#define CM_FCCLKSEL2        ((0x2B8 - 0x260) / 4)
#define CM_FCCLKSEL3        ((0x2BC - 0x260) / 4)
#define CM_FCCLKSEL4        ((0x2C0 - 0x260) / 4)
#define CM_FCCLKSEL5        ((0x2C4 - 0x260) / 4)
#define CM_FCCLKSEL6        ((0x2C8 - 0x260) / 4)
#define CM_FCCLKSEL7        ((0x2CC - 0x260) / 4)
#define CM_FCCLKSEL8        ((0x2D0 - 0x260) / 4)
#define CM_FCCLKSEL9        ((0x2D4 - 0x260) / 4)
#define CM_SCTCLKSEL        ((0x2F0 - 0x260) / 4)
#define CM_TSICLKSEL        ((0x350 - 0x260) / 4)
#define CM_SINCFILTCLKSEL   ((0x360 - 0x260) / 4)
#define CM_ADC1CLKSEL       ((0x464 - 0x260) / 4)
#define CM_DAC0CLKSEL       ((0x490 - 0x260) / 4)
#define CM_DAC1CLKSEL       ((0x498 - 0x260) / 4)
#define CM_DAC2CLKSEL       ((0x4A0 - 0x260) / 4)
#define CM_FLEXSPICLKSEL    ((0x4A8 - 0x260) / 4)
#define CM_PLLCLKDIVSEL     ((0x52C - 0x260) / 4)
#define CM_I3C0FCLKSEL      ((0x530 - 0x260) / 4)
#define CM_I3C0FCLKSTCSEL   ((0x534 - 0x260) / 4)
#define CM_I3C0FCLKSSEL     ((0x544 - 0x260) / 4)
#define CM_MICFILFCLKSEL    ((0x548 - 0x260) / 4)
#define CM_ESPICLKSEL       ((0x550 - 0x260) / 4)
#define CM_USDHCCLKSEL      ((0x558 - 0x260) / 4)
#define CM_FLEXIOCLKSEL     ((0x560 - 0x260) / 4)
#define CM_FLEXCAN0CLKSEL   ((0x5A0 - 0x260) / 4)
#define CM_FLEXCAN1CLKSEL   ((0x5A8 - 0x260) / 4)
#define CM_ENETRMIICLKSEL   ((0x5B0 - 0x260) / 4)
#define CM_ENETPTPREFCLKSEL ((0x5B8 - 0x260) / 4)
#define CM_EWM0CLKSEL       ((0x5D4 - 0x260) / 4)
#define CM_WDT1CLKSEL       ((0x5D8 - 0x260) / 4)
#define CM_OSTIMERCLKSEL    ((0x5E0 - 0x260) / 4)
#define CM_CMP0FCLKSEL      ((0x5F0 - 0x260) / 4)
#define CM_CMP0RRCLKSEL     ((0x5F8 - 0x260) / 4)
#define CM_CMP1FCLKSEL      ((0x600 - 0x260) / 4)
#define CM_CMP1RRCLKSEL     ((0x608 - 0x260) / 4)
#define CM_CMP2FCLKSEL      ((0x610 - 0x260) / 4)
#define CM_CMP2RRCLKSEL     ((0x618 - 0x260) / 4)
#define CM_SAI0CLKSEL       ((0x880 - 0x260) / 4)
#define CM_SAI1CLKSEL       ((0x884 - 0x260) / 4)
#define CM_EMVSIM0CLKSEL    ((0x890 - 0x260) / 4)
#define CM_EMVSIM1CLKSEL    ((0x894 - 0x260) / 4)
#define CM_I3C1FCLKSEL      ((0xB30 - 0x260) / 4)
#define CM_I3C1FCLKSTCSEL   ((0xB34 - 0x260) / 4)
#define CM_I3C1FCLKSSEL     ((0xB44 - 0x260) / 4)

#define CM_SCGRCCRSCSCLKSEL 0x3FEU

/*!
 * @brief The enumerator of clock attach Id.
 */
typedef enum _clock_attach_id
{
    kCLK_IN_to_MAIN_CLK   = MUX_A(CM_SCGRCCRSCSCLKSEL, 1),       /*!< Attach clk_in to MAIN_CLK. */
    kFRO12M_to_MAIN_CLK   = MUX_A(CM_SCGRCCRSCSCLKSEL, 2),       /*!< Attach FRO_12M to MAIN_CLK. */
    kFRO_HF_to_MAIN_CLK   = MUX_A(CM_SCGRCCRSCSCLKSEL, 3),       /*!< Attach FRO_HF to MAIN_CLK. */
    kXTAL32K2_to_MAIN_CLK = MUX_A(CM_SCGRCCRSCSCLKSEL, 4),       /*!< Attach xtal32k[2] to MAIN_CLK. */
    kPLL0_to_MAIN_CLK     = MUX_A(CM_SCGRCCRSCSCLKSEL, 5),       /*!< Attach PLL0 to MAIN_CLK. */
    kPLL1_to_MAIN_CLK     = MUX_A(CM_SCGRCCRSCSCLKSEL, 6),       /*!< Attach PLL1 to MAIN_CLK. */
    kUSB_PLL_to_MAIN_CLK  = MUX_A(CM_SCGRCCRSCSCLKSEL, 7),       /*!< Attach USB PLL to MAIN_CLK. */
    kNONE_to_MAIN_CLK     = MUX_A(CM_SCGRCCRSCSCLKSEL, 15),      /*!< Attach NONE to MAIN_CLK. */

    kSYSTICK_DIV0_to_SYSTICK0 = MUX_A(CM_SYSTICKCLKSEL0, 0),     /*!< Attach SYSTICK_DIV0 to SYSTICK0. */
    kCLK_1M_to_SYSTICK0       = MUX_A(CM_SYSTICKCLKSEL0, 1),     /*!< Attach Clk 1 MHz to SYSTICK0. */
    kLPOSC_to_SYSTICK0        = MUX_A(CM_SYSTICKCLKSEL0, 2),     /*!< Attach LP Oscillator to SYSTICK0. */
    kNONE_to_SYSTICK0         = MUX_A(CM_SYSTICKCLKSEL0, 7),     /*!< Attach NONE to SYSTICK0. */

    kSYSTICK_DIV1_to_SYSTICK1 = MUX_A(CM_SYSTICKCLKSEL1, 0),     /*!< Attach SYSTICK_DIV1 to SYSTICK1. */
    kCLK_1M_to_SYSTICK1       = MUX_A(CM_SYSTICKCLKSEL1, 1),     /*!< Attach Clk 1 MHz to SYSTICK1. */
    kLPOSC_to_SYSTICK1        = MUX_A(CM_SYSTICKCLKSEL1, 2),     /*!< Attach LP Oscillator to SYSTICK1. */
    kNONE_to_SYSTICK1         = MUX_A(CM_SYSTICKCLKSEL1, 7),     /*!< Attach NONE to SYSTICK1. */

