cesanta/mongoose/examples/nxp/frdm-mcxn947-xpresso-baremetal-builtin/drivers/fsl_clock.h
    kPLL_DIV_to_FLEXCOMM9    = MUX_A(CM_FCCLKSEL9, 1),           /*!< Attach PLL_DIV to FLEXCOMM9. */
    kFRO12M_to_FLEXCOMM9     = MUX_A(CM_FCCLKSEL9, 2),           /*!< Attach FRO12M to FLEXCOMM9. */
    kFRO_HF_DIV_to_FLEXCOMM9 = MUX_A(CM_FCCLKSEL9, 3),           /*!< Attach FRO_HF_DIV to FLEXCOMM9. */
    kCLK_1M_to_FLEXCOMM9     = MUX_A(CM_FCCLKSEL9, 4),           /*!< Attach CLK_1MHz to FLEXCOMM9. */
    kUSB_PLL_to_FLEXCOMM9    = MUX_A(CM_FCCLKSEL9, 5),           /*!< Attach USB_PLL to FLEXCOMM9. */
    kLPOSC_to_FLEXCOMM9      = MUX_A(CM_FCCLKSEL9, 6),           /*!< Attach LP Oscillator to FLEXCOMM9. */
    kNONE_to_FLEXCOMM9       = MUX_A(CM_FCCLKSEL9, 7),           /*!< Attach NONE to FLEXCOMM9. */

    kPLL0_to_SCT         = MUX_A(CM_SCTCLKSEL, 1),               /*!< Attach NONE to SCT. */
    kCLK_IN_to_SCT       = MUX_A(CM_SCTCLKSEL, 2),               /*!< Attach CLK_in to SCT. */
    kFRO_HF_to_SCT       = MUX_A(CM_SCTCLKSEL, 3),               /*!< Attach FRO_HF to SCT. */
    kPLL1_CLK0_to_SCT    = MUX_A(CM_SCTCLKSEL, 4),               /*!< Attach PLL1_clk0 to SCT. */
    kSAI0_MCLK_IN_to_SCT = MUX_A(CM_SCTCLKSEL, 5),               /*!< Attach SAI0 MCLK_IN to SCT. */
    kUSB_PLL_to_SCT      = MUX_A(CM_SCTCLKSEL, 6),               /*!< Attach USB PLL to SCT. */
    kSAI1_MCLK_IN_to_SCT = MUX_A(CM_SCTCLKSEL, 8),               /*!< Attach SAI1 MCLK_IN to SCT. */
    kNONE_to_SCT         = MUX_A(CM_SCTCLKSEL, 15),              /*!< Attach NONE to SCT. */

    kCLK_IN_to_TSI = MUX_A(CM_TSICLKSEL, 2),                     /*!< Attach clk_in to TSI. */
    kFRO12M_to_TSI = MUX_A(CM_TSICLKSEL, 4),                     /*!< Attach FRO_12Mhz to TSI. */
    kNONE_to_TSI   = MUX_A(CM_TSICLKSEL, 7),                     /*!< Attach NONE to TSI. */

    kPLL0_to_SINCFILT      = MUX_A(CM_SINCFILTCLKSEL, 1),        /*!< Attach PLL0 to SINCFILT. */
    kCLK_IN_to_SINCFILT    = MUX_A(CM_SINCFILTCLKSEL, 2),        /*!< Attach clk_in to SINCFILT. */
    kFRO_HF_to_SINCFILT    = MUX_A(CM_SINCFILTCLKSEL, 3),        /*!< Attach FRO_HF to SINCFILT. */
    kFRO12M_to_SINCFILT    = MUX_A(CM_SINCFILTCLKSEL, 4),        /*!< Attach FRO_12Mhz to SINCFILT. */
    kPLL1_CLK0_to_SINCFILT = MUX_A(CM_SINCFILTCLKSEL, 5),        /*!< Attach PLL1_clk0 to SINCFILT. */
    kUSB_PLL_to_SINCFILT   = MUX_A(CM_SINCFILTCLKSEL, 6),        /*!< Attach USB PLL to SINCFILT. */
    kNONE_to_SINCFILT      = MUX_A(CM_SINCFILTCLKSEL, 7),        /*!< Attach NONE to SINCFILT. */

    kPLL0_to_ADC1      = MUX_A(CM_ADC1CLKSEL, 1),                /*!< Attach PLL0 to ADC1. */
    kFRO_HF_to_ADC1    = MUX_A(CM_ADC1CLKSEL, 2),                /*!< Attach FRO_HF to ADC1. */
    kFRO12M_to_ADC1    = MUX_A(CM_ADC1CLKSEL, 3),                /*!< Attach FRO12M to ADC1. */
    kCLK_IN_to_ADC1    = MUX_A(CM_ADC1CLKSEL, 4),                /*!< Attach clk_in to ADC1. */
    kPLL1_CLK0_to_ADC1 = MUX_A(CM_ADC1CLKSEL, 5),                /*!< Attach PLL1_clk0 to ADC1. */
    kUSB_PLL_to_ADC1   = MUX_A(CM_ADC1CLKSEL, 6),                /*!< Attach USB PLL to ADC1. */
    kNONE_to_ADC1      = MUX_A(CM_ADC1CLKSEL, 7),                /*!< Attach NONE to ADC1. */

    kPLL0_to_DAC0      = MUX_A(CM_DAC0CLKSEL, 1),                /*!< Attach PLL0 to DAC0. */
    kCLK_IN_to_DAC0    = MUX_A(CM_DAC0CLKSEL, 2),                /*!< Attach Clk_in to DAC0. */
    kFRO_HF_to_DAC0    = MUX_A(CM_DAC0CLKSEL, 3),                /*!< Attach FRO_HF to DAC0. */
    kFRO12M_to_DAC0    = MUX_A(CM_DAC0CLKSEL, 4),                /*!< Attach FRO_12M to DAC0. */
    kPLL1_CLK0_to_DAC0 = MUX_A(CM_DAC0CLKSEL, 5),                /*!< Attach PLL1_clk0 to DAC0. */
    kNONE_to_DAC0      = MUX_A(CM_DAC0CLKSEL, 7),                /*!< Attach NONE to DAC0. */

    kPLL0_to_DAC1      = MUX_A(CM_DAC1CLKSEL, 1),                /*!< Attach PLL0 to DAC1. */
    kCLK_IN_to_DAC1    = MUX_A(CM_DAC1CLKSEL, 2),                /*!< Attach Clk_in to DAC1. */
    kFRO_HF_to_DAC1    = MUX_A(CM_DAC1CLKSEL, 3),                /*!< Attach FRO_HF to DAC1. */
    kFRO12M_to_DAC1    = MUX_A(CM_DAC1CLKSEL, 4),                /*!< Attach FRO_12M to DAC1. */
    kPLL1_CLK0_to_DAC1 = MUX_A(CM_DAC1CLKSEL, 5),                /*!< Attach PLL1_clk0 to DAC1. */
    kNONE_to_DAC1      = MUX_A(CM_DAC1CLKSEL, 7),                /*!< Attach NONE to DAC1. */

    kPLL0_to_DAC2      = MUX_A(CM_DAC2CLKSEL, 1),                /*!< Attach PLL0 to DAC2. */
    kCLK_IN_to_DAC2    = MUX_A(CM_DAC2CLKSEL, 2),                /*!< Attach Clk_in to DAC2. */
    kFRO_HF_to_DAC2    = MUX_A(CM_DAC2CLKSEL, 3),                /*!< Attach FRO_HF to DAC2. */
    kFRO12M_to_DAC2    = MUX_A(CM_DAC2CLKSEL, 4),                /*!< Attach FRO_12M to DAC2. */
    kPLL1_CLK0_to_DAC2 = MUX_A(CM_DAC2CLKSEL, 5),                /*!< Attach PLL1_clk0 to DAC2. */
    kNONE_to_DAC2      = MUX_A(CM_DAC2CLKSEL, 7),                /*!< Attach NONE to DAC2. */

    kPLL0_to_FLEXSPI    = MUX_A(CM_FLEXSPICLKSEL, 1),            /*!< Attach PLL0 to FLEXSPI. */
    kFRO_HF_to_FLEXSPI  = MUX_A(CM_FLEXSPICLKSEL, 3),            /*!< Attach FRO_HF to FLEXSPI. */
    kPLL1_to_FLEXSPI    = MUX_A(CM_FLEXSPICLKSEL, 5),            /*!< Attach PLL1 to FLEXSPI. */
    kUSB_PLL_to_FLEXSPI = MUX_A(CM_FLEXSPICLKSEL, 6),            /*!< Attach USB PLL to FLEXSPI. */
    kNONE_to_FLEXSPI    = MUX_A(CM_FLEXSPICLKSEL, 15),           /*!< Attach NONE to FLEXSPI. */

    kPLL0_to_PLLCLKDIV      = MUX_A(CM_PLLCLKDIVSEL, 0),         /*!< Attach PLL0 to PLLCLKDIV. */
    kPLL1_CLK0_to_PLLCLKDIV = MUX_A(CM_PLLCLKDIVSEL, 1),         /*!< Attach pll1_clk0 to PLLCLKDIV. */
    kNONE_to_PLLCLKDIV      = MUX_A(CM_PLLCLKDIVSEL, 1),         /*!< Attach NONE to PLLCLKDIV. */

    kPLL0_to_I3C0FCLK      = MUX_A(CM_I3C0FCLKSEL, 1),           /*!< Attach PLL0 to I3C0FCLK. */
    kCLK_IN_to_I3C0FCLK    = MUX_A(CM_I3C0FCLKSEL, 2),           /*!< Attach Clk_in to I3C0FCLK. */
    kFRO_HF_to_I3C0FCLK    = MUX_A(CM_I3C0FCLKSEL, 3),           /*!< Attach FRO_HF to I3C0FCLK. */
    kPLL1_CLK0_to_I3C0FCLK = MUX_A(CM_I3C0FCLKSEL, 5),           /*!< Attach PLL1_clk0 to I3C0FCLK. */
    kUSB_PLL_to_I3C0FCLK   = MUX_A(CM_I3C0FCLKSEL, 6),           /*!< Attach USB PLL to I3C0FCLK. */
    kNONE_to_I3C0FCLK      = MUX_A(CM_I3C0FCLKSEL, 7),           /*!< Attach NONE to I3C0FCLK. */

    kI3C0FCLK_to_I3C0FCLKSTC = MUX_A(CM_I3C0FCLKSTCSEL, 0),      /*!< Attach I3C0FCLK to I3C0FCLKSTC. */
    kCLK_1M_to_I3C0FCLKSTC   = MUX_A(CM_I3C0FCLKSTCSEL, 1),      /*!< Attach CLK_1M to I3C0FCLKSTC. */
    kNONE_to_I3C0FCLKSTC     = MUX_A(CM_I3C0FCLKSTCSEL, 7),      /*!< Attach NONE to I3C0FCLKSTC. */

    kCLK_1M_to_I3C0FCLKS = MUX_A(CM_I3C0FCLKSSEL, 0),            /*!< Attach CLK_1M to I3C0FCLKS. */
    kNONE_to_I3C0FCLKS   = MUX_A(CM_I3C0FCLKSSEL, 7),            /*!< Attach NONE to I3C0FCLKS. */

