cesanta/mongoose/examples/nxp/frdm-mcxn947-xpresso-baremetal-builtin/drivers/fsl_clock.h
    kPLL0_to_CMP1RR      = MUX_A(CM_CMP1RRCLKSEL, 1),            /*!< Attach PLL0 to CMP1RR. */
    kFRO_HF_to_CMP1RR    = MUX_A(CM_CMP1RRCLKSEL, 2),            /*!< Attach FRO_HF to CMP1RR. */
    kFRO12M_to_CMP1RR    = MUX_A(CM_CMP1RRCLKSEL, 3),            /*!< Attach FRO_12M to CMP1RR. */
    kCLK_IN_to_CMP1RR    = MUX_A(CM_CMP1RRCLKSEL, 4),            /*!< Attach Clk_in to CMP1RR. */
    kPLL1_CLK0_to_CMP1RR = MUX_A(CM_CMP1RRCLKSEL, 5),            /*!< Attach PLL1_clk0 to CMP1RR. */
    kUSB_PLL_to_CMP1RR   = MUX_A(CM_CMP1RRCLKSEL, 6),            /*!< Attach USB PLL to CMP1RR. */
    kNONE_to_CMP1RR      = MUX_A(CM_CMP1RRCLKSEL, 7),            /*!< Attach NONE to CMP1RR. */

    kPLL0_to_CMP2F      = MUX_A(CM_CMP2FCLKSEL, 1),              /*!< Attach PLL0 to CMP2F. */
    kFRO_HF_to_CMP2F    = MUX_A(CM_CMP2FCLKSEL, 2),              /*!< Attach FRO_HF to CMP2F. */
    kFRO12M_to_CMP2F    = MUX_A(CM_CMP2FCLKSEL, 3),              /*!< Attach FRO_12M to CMP2F. */
    kCLK_IN_to_CMP2F    = MUX_A(CM_CMP2FCLKSEL, 4),              /*!< Attach Clk_in to CMP2F. */
    kPLL1_CLK0_to_CMP2F = MUX_A(CM_CMP2FCLKSEL, 5),              /*!< Attach PLL1_clk0 to CMP2F. */
    kUSB_PLL_to_CMP2F   = MUX_A(CM_CMP2FCLKSEL, 6),              /*!< Attach USB PLL to CMP2F. */
    kNONE_to_CMP2F      = MUX_A(CM_CMP2FCLKSEL, 7),              /*!< Attach NONE to CMP2F. */

    kPLL0_to_CMP2RR      = MUX_A(CM_CMP2RRCLKSEL, 1),            /*!< Attach PLL0 to CMP2RR. */
    kFRO_HF_to_CMP2RR    = MUX_A(CM_CMP2RRCLKSEL, 2),            /*!< Attach FRO_HF to CMP2RR. */
    kFRO12M_to_CMP2RR    = MUX_A(CM_CMP2RRCLKSEL, 3),            /*!< Attach FRO_12M to CMP2RR. */
    kCLK_IN_to_CMP2RR    = MUX_A(CM_CMP2RRCLKSEL, 4),            /*!< Attach Clk_in to CMP2RR. */
    kPLL1_CLK0_to_CMP2RR = MUX_A(CM_CMP2RRCLKSEL, 5),            /*!< Attach PLL1_clk0 to CMP2RR. */
    kUSB_PLL_to_CMP2RR   = MUX_A(CM_CMP2RRCLKSEL, 6),            /*!< Attach USB PLL to CMP2RR. */
    kNONE_to_CMP2RR      = MUX_A(CM_CMP2RRCLKSEL, 7),            /*!< Attach NONE to CMP2RR. */

    kPLL0_to_SAI0      = MUX_A(CM_SAI0CLKSEL, 1),                /*!< Attach PLL0 to SAI0. */
    kCLK_IN_to_SAI0    = MUX_A(CM_SAI0CLKSEL, 2),                /*!< Attach Clk_in to SAI0. */
    kFRO_HF_to_SAI0    = MUX_A(CM_SAI0CLKSEL, 3),                /*!< Attach FRO_HF to SAI0. */
    kPLL1_CLK0_to_SAI0 = MUX_A(CM_SAI0CLKSEL, 4),                /*!< Attach PLL1_clk0 to SAI0. */
    kUSB_PLL_to_SAI0   = MUX_A(CM_SAI0CLKSEL, 6),                /*!< Attach USB PLL to SAI0. */
    kNONE_to_SAI0      = MUX_A(CM_SAI0CLKSEL, 7),                /*!< Attach NONE to SAI0. */

    kPLL0_to_SAI1      = MUX_A(CM_SAI1CLKSEL, 1),                /*!< Attach PLL0 to SAI1. */
    kCLK_IN_to_SAI1    = MUX_A(CM_SAI1CLKSEL, 2),                /*!< Attach Clk_in to SAI1. */
    kFRO_HF_to_SAI1    = MUX_A(CM_SAI1CLKSEL, 3),                /*!< Attach FRO_HF to SAI1. */
    kPLL1_CLK0_to_SAI1 = MUX_A(CM_SAI1CLKSEL, 4),                /*!< Attach PLL1_clk0 to SAI1. */
    kUSB_PLL_to_SAI1   = MUX_A(CM_SAI1CLKSEL, 6),                /*!< Attach USB PLL to SAI1. */
    kNONE_to_SAI1      = MUX_A(CM_SAI1CLKSEL, 7),                /*!< Attach NONE to SAI1. */

    kPLL0_to_EMVSIM0      = MUX_A(CM_EMVSIM0CLKSEL, 1),          /*!< Attach PLL0 to EMVSIM0. */
    kCLK_IN_to_EMVSIM0    = MUX_A(CM_EMVSIM0CLKSEL, 2),          /*!< Attach Clk_in to EMVSIM0. */
    kFRO_HF_to_EMVSIM0    = MUX_A(CM_EMVSIM0CLKSEL, 3),          /*!< Attach FRO_HF to EMVSIM0. */
    kFRO12M_to_EMVSIM0    = MUX_A(CM_EMVSIM0CLKSEL, 4),          /*!< Attach FRO_12M to EMVSIM0. */
    kPLL1_CLK0_to_EMVSIM0 = MUX_A(CM_EMVSIM0CLKSEL, 5),          /*!< Attach PLL1_clk0 to EMVSIM0. */
    kNONE_to_EMVSIM0      = MUX_A(CM_EMVSIM0CLKSEL, 7),          /*!< Attach NONE to EMVSIM0. */

    kPLL0_to_EMVSIM1      = MUX_A(CM_EMVSIM1CLKSEL, 1),          /*!< Attach PLL0 to EMVSIM1. */
    kCLK_IN_to_EMVSIM1    = MUX_A(CM_EMVSIM1CLKSEL, 2),          /*!< Attach Clk_in to EMVSIM1. */
    kFRO_HF_to_EMVSIM1    = MUX_A(CM_EMVSIM1CLKSEL, 3),          /*!< Attach FRO_HF to EMVSIM1. */
    kFRO12M_to_EMVSIM1    = MUX_A(CM_EMVSIM1CLKSEL, 4),          /*!< Attach FRO_12M to EMVSIM1. */
    kPLL1_CLK0_to_EMVSIM1 = MUX_A(CM_EMVSIM1CLKSEL, 5),          /*!< Attach PLL1_clk0 to EMVSIM1. */
    kNONE_to_EMVSIM1      = MUX_A(CM_EMVSIM1CLKSEL, 7),          /*!< Attach NONE to EMVSIM1. */

    kPLL0_to_I3C1FCLK      = MUX_A(CM_I3C1FCLKSEL, 1),           /*!< Attach PLL0 to I3C1FCLK. */
    kCLK_IN_to_I3C1FCLK    = MUX_A(CM_I3C1FCLKSEL, 2),           /*!< Attach Clk_in to I3C1FCLK. */
    kFRO_HF_to_I3C1FCLK    = MUX_A(CM_I3C1FCLKSEL, 3),           /*!< Attach FRO_HF to I3C1FCLK. */
    kPLL1_CLK0_to_I3C1FCLK = MUX_A(CM_I3C1FCLKSEL, 5),           /*!< Attach PLL1_clk0 to I3C1FCLK. */
    kUSB_PLL_to_I3C1FCLK   = MUX_A(CM_I3C1FCLKSEL, 6),           /*!< Attach USB PLL to I3C1FCLK. */
    kNONE_to_I3C1FCLK      = MUX_A(CM_I3C1FCLKSEL, 7),           /*!< Attach NONE to I3C1FCLK. */

    kI3C1FCLK_to_I3C1FCLKSTC = MUX_A(CM_I3C1FCLKSTCSEL, 0),      /*!< Attach I3C1FCLK to I3C1FCLKSTC. */
    kCLK_1M_to_I3C1FCLKSTC   = MUX_A(CM_I3C1FCLKSTCSEL, 1),      /*!< Attach CLK_1M to I3C1FCLKSTC. */
    kNONE_to_I3C1FCLKSTC     = MUX_A(CM_I3C1FCLKSTCSEL, 7),      /*!< Attach NONE to I3C1FCLKSTC. */

    kCLK_1M_to_I3C1FCLKS = MUX_A(CM_I3C1FCLKSSEL, 0),            /*!< Attach CLK_1M to I3C1FCLKS. */
    kNONE_to_I3C1FCLKS   = MUX_A(CM_I3C1FCLKSSEL, 7),            /*!< Attach NONE to I3C1FCLKS. */

    kNONE_to_NONE = (int)0x80000000U,                            /*!< Attach NONE to NONE. */

} clock_attach_id_t;

/*! @brief Clock dividers */
typedef enum _clock_div_name
{
    kCLOCK_DivSystickClk0   = 0,                     /*!< Systick Clk0 Divider. */
    kCLOCK_DivSystickClk1   = ((0x304 - 0x300) / 4), /*!< Systick Clk1 Divider. */
    kCLOCK_DivTraceClk      = ((0x308 - 0x300) / 4), /*!< Trace Clk Divider. */
    kCLOCK_DivSlowClk       = ((0x378 - 0x300) / 4), /*!< SLOW CLK Divider. */
    kCLOCK_DivTsiClk        = ((0x37C - 0x300) / 4), /*!< Tsi Clk Divider. */
    kCLOCK_DivAhbClk        = ((0x380 - 0x300) / 4), /*!< Ahb Clk Divider. */
    kCLOCK_DivClkOut        = ((0x384 - 0x300) / 4), /*!< ClkOut Clk Divider. */
    kCLOCK_DivFrohfClk      = ((0x388 - 0x300) / 4), /*!< Frohf Clk Divider. */
    kCLOCK_DivWdt0Clk       = ((0x38C - 0x300) / 4), /*!< Wdt0 Clk Divider. */
    kCLOCK_DivAdc0Clk       = ((0x394 - 0x300) / 4), /*!< Adc0 Clk Divider. */
    kCLOCK_DivUsb0Clk       = ((0x398 - 0x300) / 4), /*!< Usb0 Clk Divider. */
    kCLOCK_DivSctClk        = ((0x3B4 - 0x300) / 4), /*!< Sct Clk Divider. */
    kCLOCK_DivPllClk        = ((0x3C4 - 0x300) / 4), /*!< Pll Clk Divider. */
    kCLOCK_DivCtimer0Clk    = ((0x3D0 - 0x300) / 4), /*!< Ctimer0 Clk Divider. */
    kCLOCK_DivCtimer1Clk    = ((0x3D4 - 0x300) / 4), /*!< Ctimer1 Clk Divider. */
    kCLOCK_DivCtimer2Clk    = ((0x3D8 - 0x300) / 4), /*!< Ctimer2 Clk Divider. */
    kCLOCK_DivCtimer3Clk    = ((0x3DC - 0x300) / 4), /*!< Ctimer3 Clk Divider. */
    kCLOCK_DivCtimer4Clk    = ((0x3E0 - 0x300) / 4), /*!< Ctimer4 Clk Divider. */
    kCLOCK_DivPLL1Clk0      = ((0x3E4 - 0x300) / 4), /*!< PLL1 Clk0 Divider. */
    kCLOCK_DivPLL1Clk1      = ((0x3E8 - 0x300) / 4), /*!< Pll1 Clk1 Divider. */
    kCLOCK_DivAdc1Clk       = ((0x468 - 0x300) / 4), /*!< Adc1 Clk Divider. */
    kCLOCK_DivDac0Clk       = ((0x494 - 0x300) / 4), /*!< Dac0 Clk Divider. */
    kCLOCK_DivDac1Clk       = ((0x49C - 0x300) / 4), /*!< Dac1 Clk Divider. */
    kCLOCK_DivDac2Clk       = ((0x4A4 - 0x300) / 4), /*!< Dac2 Clk Divider. */
    kCLOCK_DivFlexspiClk    = ((0x4AC - 0x300) / 4), /*!< Flexspi Clk Divider. */
    kCLOCK_DivI3c0FClkStc   = ((0x538 - 0x300) / 4), /*!< I3C0 FCLK STC Divider. */
    kCLOCK_DivI3c0FClkS     = ((0x53C - 0x300) / 4), /*!< I3C0 FCLK S Divider. */
    kCLOCK_DivI3c0FClk      = ((0x540 - 0x300) / 4), /*!< I3C0 FClk Divider. */
    kCLOCK_DivMicfilFClk    = ((0x54C - 0x300) / 4), /*!< MICFILFCLK Divider. */
    kCLOCK_DivEspiClk       = ((0x554 - 0x300) / 4), /*!< Espi Clk Divider. */
    kCLOCK_DivUSdhcClk      = ((0x55C - 0x300) / 4), /*!< USdhc Clk Divider. */
    kCLOCK_DivFlexioClk     = ((0x564 - 0x300) / 4), /*!< Flexio Clk Divider. */
    kCLOCK_DivFlexcan0Clk   = ((0x5A4 - 0x300) / 4), /*!< Flexcan0 Clk Divider. */
    kCLOCK_DivFlexcan1Clk   = ((0x5AC - 0x300) / 4), /*!< Flexcan1 Clk Divider. */
    kCLOCK_DivEnetrmiiClk   = ((0x5B4 - 0x300) / 4), /*!< Enetrmii Clk Divider. */
    kCLOCK_DivEnetptprefClk = ((0x5BC - 0x300) / 4), /*!< Enetptpref Clk Divider. */
    kCLOCK_DivWdt1Clk       = ((0x5DC - 0x300) / 4), /*!< Wdt1 Clk Divider. */
    kCLOCK_DivCmp0FClk      = ((0x5F4 - 0x300) / 4), /*!< Cmp0 FClk Divider. */
    kCLOCK_DivCmp0rrClk     = ((0x5FC - 0x300) / 4), /*!< Cmp0rr Clk Divider. */
    kCLOCK_DivCmp1FClk      = ((0x604 - 0x300) / 4), /*!< Cmp1 FClk Divider. */
    kCLOCK_DivCmp1rrClk     = ((0x60C - 0x300) / 4), /*!< Cmp1rr Clk Divider. */
    kCLOCK_DivCmp2FClk      = ((0x614 - 0x300) / 4), /*!< Cmp2 FClk Divider. */
    kCLOCK_DivCmp2rrClk     = ((0x61C - 0x300) / 4), /*!< Cmp2rr Clk Divider. */
    kCLOCK_DivFlexcom0Clk   = ((0x850 - 0x300) / 4), /*!< Flexcom0 Clk Divider. */
    kCLOCK_DivFlexcom1Clk   = ((0x854 - 0x300) / 4), /*!< Flexcom1 Clk Divider. */
    kCLOCK_DivFlexcom2Clk   = ((0x858 - 0x300) / 4), /*!< Flexcom2 Clk Divider. */
    kCLOCK_DivFlexcom3Clk   = ((0x85C - 0x300) / 4), /*!< Flexcom3 Clk Divider. */
    kCLOCK_DivFlexcom4Clk   = ((0x860 - 0x300) / 4), /*!< Flexcom4 Clk Divider. */
    kCLOCK_DivFlexcom5Clk   = ((0x864 - 0x300) / 4), /*!< Flexcom5 Clk Divider. */
    kCLOCK_DivFlexcom6Clk   = ((0x868 - 0x300) / 4), /*!< Flexcom6 Clk Divider. */
    kCLOCK_DivFlexcom7Clk   = ((0x86C - 0x300) / 4), /*!< Flexcom7 Clk Divider. */
    kCLOCK_DivFlexcom8Clk   = ((0x870 - 0x300) / 4), /*!< Flexcom8 Clk Divider. */
    kCLOCK_DivFlexcom9Clk   = ((0x874 - 0x300) / 4), /*!< Flexcom9 Clk Divider. */
    kCLOCK_DivSai0Clk       = ((0x888 - 0x300) / 4), /*!< Sai0 Clk Divider. */
    kCLOCK_DivSai1Clk       = ((0x88C - 0x300) / 4), /*!< Sai1 Clk Divider. */
    kCLOCK_DivEmvsim0Clk    = ((0x898 - 0x300) / 4), /*!< Emvsim0 Clk Divider. */
    kCLOCK_DivEmvsim1Clk    = ((0x89C - 0x300) / 4), /*!< Emvsim1 Clk Divider. */
    kCLOCK_DivI3c1FClkStc   = ((0xB38 - 0x300) / 4), /*!< I3C1 FCLK STC Divider. */
    kCLOCK_DivI3c1FClkS     = ((0xB3C - 0x300) / 4), /*!< I3C1 FCLK S Divider. */
    kCLOCK_DivI3c1FClk      = ((0xB40 - 0x300) / 4), /*!< I3C1 FClk Divider. */
} clock_div_name_t;

/*! @brief OSC32K clock gate */
typedef enum _osc32k_clk_gate_id
{
    kCLOCK_Osc32kToVbat = 0x1, /*!< OSC32K[0] to VBAT domain. */
    kCLOCK_Osc32kToVsys = 0x2, /*!< OSC32K[1] to VSYS domain. */
    kCLOCK_Osc32kToWake = 0x4, /*!< OSC32K[2] to WAKE domain. */
    kCLOCK_Osc32kToMain = 0x8, /*!< OSC32K[3] to MAIN domain. */
    kCLOCK_Osc32kToAll  = 0xF, /*!< OSC32K to VBAT,VSYS,WAKE,MAIN domain. */
} osc32k_clk_gate_id_t;

/*! @brief CLK16K clock gate */
typedef enum _clk16k_clk_gate_id
{
    kCLOCK_Clk16KToVbat = 0x1, /*!< Clk16k[0] to VBAT domain. */
    kCLOCK_Clk16KToVsys = 0x2, /*!< Clk16k[1] to VSYS domain. */
    kCLOCK_Clk16KToWake = 0x4, /*!< Clk16k[2] to WAKE domain. */
    kCLOCK_Clk16KToMain = 0x8, /*!< Clk16k[3] to MAIN domain. */
    kCLOCK_Clk16KToAll  = 0xF, /*!< Clk16k to VBAT,VSYS,WAKE,MAIN domain. */
} clk16k_clk_gate_id_t;

/*! @brief system clocks enable controls */
typedef enum _clock_ctrl_enable
{
    kCLOCK_PLU_DEGLITCH_CLK_ENA =
        SYSCON_CLOCK_CTRL_PLU_DEGLITCH_CLK_ENA_MASK, /*!< Enables clocks FRO_1MHz and FRO_12MHz for PLU deglitching. */
    kCLOCK_FRO1MHZ_CLK_ENA =
        SYSCON_CLOCK_CTRL_FRO1MHZ_CLK_ENA_MASK,      /*!< Enables FRO_1MHz clock for clock muxing in clock gen. */
    kCLOCK_CLKIN_ENA =
        SYSCON_CLOCK_CTRL_CLKIN_ENA_MASK,  /*!< Enables clk_in clock for MICD, EMVSIM0/1, CAN0/1, I3C0/1, SAI0/1, SINC
                                              Filter (SINC), TSI, USBFS, SCT, uSDHC, clkout.. */
    kCLOCK_FRO_HF_ENA =
        SYSCON_CLOCK_CTRL_FRO_HF_ENA_MASK, /*!< Enables FRO HF clock for the Frequency Measure module. */
    kCLOCK_FRO12MHZ_ENA = SYSCON_CLOCK_CTRL_FRO12MHZ_ENA_MASK, /*!< Enables the FRO_12MHz clock for the Flash,
                                                                  LPTIMER0/1, and Frequency Measurement modules. */
    kCLOCK_FRO1MHZ_ENA =
        SYSCON_CLOCK_CTRL_FRO1MHZ_ENA_MASK,           /*!< Enables the FRO_1MHz clock for RTC module and for UTICK. */
    kCLOCK_CLKIN_ENA_FM_USBH_LPT =
        SYSCON_CLOCK_CTRL_CLKIN_ENA_FM_USBH_LPT_MASK, /*!< Enables the clk_in clock for the Frequency Measurement, USB
                                                         HS and LPTIMER0/1 modules. */
} clock_ctrl_enable_t;

/*! @brief Source of the USB HS PHY. */
typedef enum _clock_usb_phy_src
{
    kCLOCK_Usbphy480M = 0, /*!< Use 480M.      */
} clock_usb_phy_src_t;

/*!
 * @brief SCG status return codes.
 */
enum _scg_status
{
    kStatus_SCG_Busy       = MAKE_STATUS(kStatusGroup_SCG, 1), /*!< Clock is busy.  */
    kStatus_SCG_InvalidSrc = MAKE_STATUS(kStatusGroup_SCG, 2)  /*!< Invalid source. */
};

/*!
 * @brief firc trim mode.
 */
typedef enum _firc_trim_mode
{
    kSCG_FircTrimNonUpdate = SCG_FIRCCSR_FIRCTREN_MASK,
    /*!< Trim enable but not enable trim value update. In this mode, the
     trim value is fixed to the initialized value which is defined by
     trimCoar and trimFine in configure structure \ref trim_config_t.*/

    kSCG_FircTrimUpdate = SCG_FIRCCSR_FIRCTREN_MASK | SCG_FIRCCSR_FIRCTRUP_MASK
    /*!< Trim enable and trim value update enable. In this mode, the trim
     value is auto update. */

} firc_trim_mode_t;

/*!
 * @brief firc trim source.
 */
typedef enum _firc_trim_src
{
    kSCG_FircTrimSrcUsb0   = 0U, /*!< USB0 start of frame (1kHz). */
    kSCG_FircTrimSrcSysOsc = 2U, /*!< System OSC.                 */
    kSCG_FircTrimSrcRtcOsc = 3U, /*!< RTC OSC (32.768 kHz).       */
} firc_trim_src_t;

/*!
 * @brief firc trim configuration.
 */
typedef struct _firc_trim_config
{
    firc_trim_mode_t trimMode; /*!< Trim mode.                       */
    firc_trim_src_t trimSrc;   /*!< Trim source.                          */
    uint16_t trimDiv;          /*!< Divider of SOSC.             */

    uint8_t trimCoar;          /*!< Trim coarse value; Irrelevant if trimMode is kSCG_TrimUpdate. */
    uint8_t trimFine;          /*!< Trim fine value; Irrelevant if trimMode is kSCG_TrimUpdate. */
} firc_trim_config_t;

/*!
 * @brief sirc trim mode.
 */
typedef enum _sirc_trim_mode
{
    kSCG_SircTrimNonUpdate = SCG_SIRCCSR_SIRCTREN_MASK,
    /*!< Trim enable but not enable trim value update. In this mode, the
     trim value is fixed to the initialized value which is defined by
     trimCoar and trimFine in configure structure \ref trim_config_t.*/

